// while цикл з передумовою потрібний коли спершу 
//потрібно перевірити умову і якщо вона не хибна тіло циклу буде виконуватися
// цикли потрібні якщо один і той самий код має виконуватися по декілька разів.
// цикл завершується коли поверне false. В противному випадку буде безкінечний цикл. 
//let n = 0

//while (n < 3) {
//    console.log(`цикл повернув істинну ${n}`);
//    n++;
//}

//let n = 5

//while (n) {
//    console.log(n);
//    n--;
//}

// do while це постумовний цикл якому сперщу обробляється код в тілі цикла, і потім сама умова
//let n = 0;
//do {
//    console.log(n);
//    n++;
//} while (n < 5);

/* FOR цикл з передумовою який має більше налаштувань
 робота даного циклу 
 1.виконується оголошення змінної зі значенням
 2.виконується безпосередньо умова
 3.якщо умова істина (true) то виконується
 ціло циклу
 4.виконується крок (інкремент або декремент)
 5. повтор кроків починається з пункту 2 оскільки
 зміна оголошується раз
*/
/*for (num = 0; num < 5; num++) {
    console.log(num);
} */
/*let num;
for (num = 0; num < 5; num++) {
    console.log(num);
}
console.log (`Результат ${num}`); */

// також можна забрати будь-яку частину з циклу FOR

/*let num = 0;
for (; num < 5;) {
    console.log(num);
    num++;
}*/

//директива break потрібна коли ми хочемо перервати весь цикл, якщо було досягнуто певний результат до закічення циклу

/*let num = 0;
for (; num < 5; num++) {
    console.log(num);
    if (num == 3) break;
}
console.log (`Результат ${num}`); */

//директива continue потрібна коли ми хочемо перервати частину тіла циклу і переходить до наступної ітерарації (виконання) тіла циклу
/*let num = 0;
for (; num < 5; num++) {
    if (num == 3) continue;
    console.log (`Результат ${num}`);
}*/

// мітки для циклу необхідні якщо в у тілі одного цикла є інший та необхідно переривати дочірній цикл та перейти до ітерації батьківського тим самим впливаючи на нього
// за допомогою мітки не можна перестрибувати в довільне місце коду
/*firstFor: for (n = 0; n < 2; n++) {

 for (num = 0; num < 5; num++) {
    if (num == 2) {
        break firstFor;
    }
    console.log (`Результат ${num}`);
 }
} */

firstFor: for (n = 0; n < 2; n++) {

    for (num = 0; num < 5; num++) {
       if (num == 2) {
           continue firstFor;
       }
       console.log (`Результат ${num}`);
    }
   }