//let message = 'Доброго вечора, ми з України !';

//if (5 > 3) { // код виконається якщо дотримана умова і значення її true, а не false
             // якщо буде 5 > 6 false, то повідомлення в консолі не виведеться
  //  console.log(message);
//}

let message = 'Доброго вечора, ми з України !';
//let a = 8;
//let b = 10;

//if (a===b) { //else використовується як альтернативний варіант, якщо головна умова не виконується 
  //  console.log(message);
//} else {
  //  console.log(`Значення умови хибне`); 
//}

// складніші умови

//if (1 + 1 === 3 && "2" == 2 || 10 > 6 && "true") { //true поверне значення тому, що спершу виконуються оператори І по пріоритетності
                                                   // і тільки після них оператор АБО якому достатньо хоча б одного істиного значення операторів І
  //  console.log(message);
//}

// пусті лапки та 0 мають знанчення хиби. Якщо у пустих лапках додати пробіл то значення стане істинним. Одиниця 1 теж є істиною.
//if (1) {
    //console.log(message);
//}

// else if діє аналогічно як і else в якості альтернативи до якої ще додається умова

//if ( 5 > 8 ) {
  //  console.log(message); 
//} else if ( 10==12 ) {
  //  console.log(message); 
//} else if ( 10 < 12 ) { //  true
  //  console.log(message); 
//} else {
  //  console.log (`Жодна умова не є істиною`);
//}

// оператор ? робить те саме, що if else(if) але скорочено. Знак : двокрапки виконує роль else
//let names = (5 < 7) ? ", Олександр" : ", Ольга"; // даний оператор має низький пріоритет тому дужки необовязкові
//message += names;
//console.log(message);






